views/dashboard/engine.php

$channelid=$_SESSION['channelid'];
$EngineOnReq="https://api.thingspeak.com/update?api_key=".$channelapi."&field2=1";
$EngineOffREq="https://api.thingspeak.com/update?api_key=".$channelapi."&field2=0";
$EngineModel=EngineTracker::find()->where('created_by=:created_by',[':created_by'=>$_SESSION['userid']])->one();
---
SELECT * FROM `engine_tracker` WHERE created_by='1'