views/dashboard/listusers.php

                            <td><?=$rowval['device']?></td>
                            <td>
                                <?php
                                  $DeviceMaster=\app\models\DeviceMaster::findOne($rowval['device']);
---
SELECT * FROM `device_master` WHERE `id`='1'

                                $channelid=$DeviceMaster->channel_id;
                                $EngineOnReq="https://api.thingspeak.com/update?api_key=".$channelapi."&field2=1";
                                $EngineOffREq="https://api.thingspeak.com/update?api_key=".$channelapi."&field2=0";
                                $EngineModel=\app\models\EngineTracker::find()->where('created_by=:created_by',[':created_by'=>$rowval['u_id']])->one();
---
SELECT * FROM `engine_tracker` WHERE created_by='2'