views/dashboard/listusers.php

SELECT * FROM `engine_tracker` WHERE created_by='2' and device_id='1'
---
                            <td>
                                <?php if($rowval['user_status'] =="A") { ?>
                                    <?php
                                    $engineModel=\app\models\EngineTracker::find()
                                        ->where('created_by=:by and device_id=:device',
                                            [':by'=>$rowval['u_id'],
                                                ':device'=>$rowval['device']])->one();?>