views/layouts/header.php

SELECT * FROM `user` WHERE `u_id`='1'
---
                    <a href="#" class="dropdown-toggle" data-toggle="dropdown">
                        <?php
                          if(isset($_SESSION['userid'])){
                              $user=\app\models\TUser::findOne($_SESSION['userid']);