views/layouts/sidebar.php

        <div class="user-panel">
            <?php
            if(isset($_SESSION) && isset($_SESSION['userid']) ){
                $user=\app\models\TUser::findOne($_SESSION['userid']);
---
SELECT * FROM `user` WHERE `u_id`='1'