controllers/DashboardController.php

    public function actionReslist(){
        $resultArray=[];
        $AuthImgModel=AuthorizeImg::find()->where('created_by =:user',
            [':user'=>$_SESSION['userid']])->all();
---
SELECT * FROM `user` WHERE user_type='U'

    public function actionUserlist(){
        $UserModel=User::find()->select(['user.*','A.channel_api','A.channel_id'])->
        leftJoin('device_master as A','A.id=device')
            ->where('user_type=:type',
            [':type'=>'U'])->asArray()->all();
---
SELECT `user`.*, `A`.`channel_api`, `A`.`channel_id` FROM `user` LEFT JOIN `device_master` `A` ON A.id=device WHERE user_type='U'

    public function sbsmail(){
        $filterId=intval($_GET['id']);
        $UserModel=User::findOne($filterId);
---
SELECT * FROM `user` WHERE `u_id`=2

    public function SendmailIncative($id){

        $filterId=intval($id);
        $UserModel=User::findOne($filterId);
---
SELECT * FROM `user` WHERE `u_id`=3