controllers/DashboardController.php

    public function saveandupdate($data){
        if(!empty($data)){
            $userid=$data['userid'];
            if(!empty($userid)){
                $UserModel=User::findOne($userid);
                $msg='Updated Successfully';
            }else {
                $UserModel = new User();
                $msg='Created Successfully';
                $UsernameCheck=User::find()->where('username=:usrname',[':usrname'=>$_POST['username']])->one();
                if(!empty($UsernameCheck)){
                    $returnArr=['flag'=>'E','code'=>500,'msg'=>'Username already exists'];
                    return  $returnArr;
                }
                $UsernameMail=User::find()->where('email=:email',[':email'=>$_POST['email']])->one();
                if(!empty($UsernameMail)){
                    $returnArr=['flag'=>'E','code'=>500,'msg'=>'Email already exists'];
                    return  $returnArr;
                }
                $UsernameMobile=User::find()->where('mobile=:mobile',[':mobile'=>$_POST['mobilenumber']])->one();
---
SELECT * FROM `user` WHERE `u_id`=1
SELECT * FROM `user` WHERE `u_id`='1'
SELECT * FROM `user` WHERE username='admin@splat.com'

                move_uploaded_file($_FILES["profile"]["tmp_name"], $target_file);
                $UserModel->user_profile=$_FILES["profile"]["name"];
            }
            if($UserModel->save(false)){
---
UPDATE `user` SET `age`=25, `device`=1, `user_type`='U', `user_profile`='image.png', `user_createdat`='2021-03-27 11:44:28' WHERE `u_id`=1

    public function actionSavetracker()
    {
        if (isset($_REQUEST)) {
            $requesturl=$_REQUEST['requesturl'];
            $responseArr = [];
            $REsponseModel = new ResponseTracker();
            $REsponseModel->response_text = $this->Curlexe($requesturl);
            $REsponseModel->response_createdon = date('Y-m-d');
            $REsponseModel->response_created_by = $_SESSION['userid'];
            if ($REsponseModel->save(false)) {
---
INSERT INTO `response_tracker` (`response_text`, `response_createdon`, `response_created_by`) VALUES ('{\"channel\":{\"id\":712150,\"name\":\"REAL TIME PROJECT\",\"latitude\":\"0.0\",\"longitude\":\"0.0\",\"field1\":\"Field Label 1\",\"field2\":\"Field Label 2\",\"field3\":\"Field Label 3\",\"field4\":\"Field Label 4\",\"field5\":\"Field Label 5\",\"field6\":\"Field Label 6\",\"field7\":\"Field Label 7\",\"field8\":\"Field Label 8\",\"created_at\":\"2019-02-24T09:40:23Z\",\"updated_at\":\"2021-01-21T05:35:22Z\",\"last_entry_id\":757},\"feeds\":[{\"created_at\":\"2021-03-25T16:48:08Z\",\"entry_id\":757,\"field3\":\"3\"}]}', '2021-03-25', 1)

    public function actionUserlist(){
        $UserModel=User::find()->where('user_type=:type',[':type'=>'U'])->asArray()->all();
---
SELECT * FROM `user` WHERE `u_id`=5

    public function actionChangestatus(){

        $filterId=intval($_GET['id']);
        $UserModel=User::findOne($filterId);
        $UserModel->user_status=$UserModel->user_status=='A'?'I':'A';
        if($UserModel->save(false)){
---
SELECT * FROM `user` WHERE `u_id`=5
UPDATE `user` SET `user_status`='A' WHERE `u_id`=5

    public function actionSendmail(){
        $filterId=intval($_GET['id']);
        $UserModel=User::findOne($filterId);
---
SELECT * FROM `user` WHERE `u_id`=2