controllers/DashboardController.php

SELECT * FROM `engine_tracker` WHERE device_id=1
---
    public function actionEngine()
    {
        $reTEngineArr=[];
        if(isset($_REQUEST) && isset($_REQUEST['status'])){
            $EngineModel=EngineTracker::find()->where('device_id=:device',[':device'=>1])->one();