models/TUser.php

SELECT * FROM `user` WHERE (username='8807642914' or mobile='8807642914' or email='8807642914') and password='testtest' and user_status="A"
SELECT * FROM `device_master` WHERE `id`='1'
---
    public static  function loginCheck($data){
        $Usermodel=self::find()->where('(username=:username or mobile=:username or email=:username) and password=:password',
            [':username'=>$data['username'],
                ':password'=>$data['password']
            ])->asArray()->one();
        //echo "<pre>";print_r($Usermodel);die;
        $statusarray=[];
       if(!empty($Usermodel)){
           if(!isset($_SESSION))
           {
               session_start();
           }
           $DeviceModel=DeviceMaster::findOne($Usermodel['device']);